Ran Plan for dir: `terragrunt/kubernetes/longhorn` workspace: `terragrunt_kubernetes_longhorn`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\') -no-color -out $PLANFILE' in '/home/atlantis/.atlantis/repos/youhide/hideForming/31/terragrunt_kubernetes_longhorn/terragrunt/kubernetes/longhorn': exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/home/atlantis/.atlantis/repos/youhide/hideForming/31/terragrunt_kubernetes_longhorn/terragrunt/kubernetes/longhorn": 
01:00:56.629 INFO   [../../openmediavault/minio] Downloading Terraform configurations from ../../../modules/terraform/minio into ../../openmediavault/minio/.terragrunt-cache/J1263lACqq3PUD7EL4dVCIxFXCU/t3aAU9bWTLUAVKpFU51sF2TIBZg
01:00:56.654 INFO   [../../openmediavault/minio] tofu: Initializing the backend...
01:00:56.675 INFO   [../../openmediavault/minio] tofu: 
01:00:56.675 INFO   [../../openmediavault/minio] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
01:00:56.675 INFO   [../../openmediavault/minio] tofu: use this backend unless the backend configuration changes.
01:00:56.693 INFO   [../../openmediavault/minio] tofu: Initializing provider plugins...
01:00:56.693 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:57.312 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:57.601 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:57.936 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:58.237 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:58.545 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:58.878 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:59.187 INFO   [../../openmediavault/minio] tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:01.751 INFO   [../../openmediavault/minio] tofu: - Installing hashicorp/kubernetes v2.36.0...
01:01:03.893 INFO   [../../openmediavault/minio] tofu: - Installed hashicorp/kubernetes v2.36.0 (signed, key ID 0C0AF313E5FD9F80)
01:01:06.188 INFO   [../../openmediavault/minio] tofu: - Installing hashicorp/helm v3.0.0-pre2...
01:01:43.295 INFO   [../../openmediavault/minio] tofu: - Installed hashicorp/helm v3.0.0-pre2 (signed, key ID 0C0AF313E5FD9F80)
01:01:45.620 INFO   [../../openmediavault/minio] tofu: - Installing goauthentik/authentik v2025.4.0...
01:01:48.111 INFO   [../../openmediavault/minio] tofu: - Installed goauthentik/authentik v2025.4.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:01:50.051 INFO   [../../openmediavault/minio] tofu: - Installing gavinbunney/kubectl v1.19.0...
01:01:53.812 INFO   [../../openmediavault/minio] tofu: - Installed gavinbunney/kubectl v1.19.0 (signed, key ID 1E1CE42504F5FBB2)
01:01:56.074 INFO   [../../openmediavault/minio] tofu: - Installing aminueza/minio v3.5.0...
01:01:57.593 INFO   [../../openmediavault/minio] tofu: - Installed aminueza/minio v3.5.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:01:59.654 INFO   [../../openmediavault/minio] tofu: - Installing cloudflare/cloudflare v5.4.0...
01:02:02.332 INFO   [../../openmediavault/minio] tofu: - Installed cloudflare/cloudflare v5.4.0 (signed, key ID C76001609EE3B136)
01:02:03.797 INFO   [../../openmediavault/minio] tofu: - Installing hashicorp/vault v4.8.0...
01:02:05.317 INFO   [../../openmediavault/minio] tofu: - Installed hashicorp/vault v4.8.0 (signed, key ID 0C0AF313E5FD9F80)
01:02:06.763 INFO   [../../openmediavault/minio] tofu: - Installing telmate/proxmox v3.0.1-rc8...
01:02:07.921 INFO   [../../openmediavault/minio] tofu: - Installed telmate/proxmox v3.0.1-rc8. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:02:07.921 INFO   [../../openmediavault/minio] tofu: Providers are signed by their developers.
01:02:07.921 INFO   [../../openmediavault/minio] tofu: If you'd like to know more about provider signing, you can read about it here:
01:02:07.921 INFO   [../../openmediavault/minio] tofu: https://opentofu.org/docs/cli/plugins/signing/
01:02:07.921 INFO   [../../openmediavault/minio] tofu: OpenTofu has made some changes to the provider dependency selections recorded
01:02:07.921 INFO   [../../openmediavault/minio] tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
01:02:07.921 INFO   [../../openmediavault/minio] tofu: version control system if they represent changes you intended to make.
01:02:07.923 INFO   [../../openmediavault/minio] tofu: OpenTofu has been successfully initialized!
01:02:08.219 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/vDeUHIUFt78pEwGiXPS1x3QJjok/CMgYoIKCnhbkpRAUkBJBc7x_LD8
01:02:08.247 INFO   tofu: Initializing the backend...
01:02:08.261 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
01:02:08.261 INFO   tofu: use this backend unless the backend configuration changes.
01:02:08.279 INFO   tofu: Initializing provider plugins...
01:02:08.279 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:02:08.479 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:02:08.600 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:02:08.711 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:02:08.831 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:02:08.945 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:02:09.058 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:02:09.183 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:02:10.723 INFO   tofu: - Installing hashicorp/vault v4.8.0...
01:02:15.488 INFO   tofu: - Installed hashicorp/vault v4.8.0 (signed, key ID 0C0AF313E5FD9F80)
01:02:17.009 INFO   tofu: - Installing telmate/proxmox v3.0.1-rc8...
01:02:18.218 INFO   tofu: - Installed telmate/proxmox v3.0.1-rc8. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:02:19.650 INFO   tofu: - Installing hashicorp/kubernetes v2.36.0...
01:02:21.408 INFO   tofu: - Installed hashicorp/kubernetes v2.36.0 (signed, key ID 0C0AF313E5FD9F80)
01:02:22.861 INFO   tofu: - Installing hashicorp/helm v3.0.0-pre2...
01:02:24.730 INFO   tofu: - Installed hashicorp/helm v3.0.0-pre2 (signed, key ID 0C0AF313E5FD9F80)
01:02:26.199 INFO   tofu: - Installing goauthentik/authentik v2025.4.0...
01:02:27.621 INFO   tofu: - Installed goauthentik/authentik v2025.4.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:02:29.712 INFO   tofu: - Installing gavinbunney/kubectl v1.19.0...
01:02:31.471 INFO   tofu: - Installed gavinbunney/kubectl v1.19.0 (signed, key ID 1E1CE42504F5FBB2)
01:02:32.914 INFO   tofu: - Installing aminueza/minio v3.5.0...
01:02:34.175 INFO   tofu: - Installed aminueza/minio v3.5.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
01:02:35.617 INFO   tofu: - Installing cloudflare/cloudflare v5.4.0...
01:02:37.895 INFO   tofu: - Installed cloudflare/cloudflare v5.4.0 (signed, key ID C76001609EE3B136)
01:02:37.896 INFO   tofu: Providers are signed by their developers.
01:02:37.896 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
01:02:37.896 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
01:02:37.896 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
01:02:37.896 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
01:02:37.896 INFO   tofu: version control system if they represent changes you intended to make.
01:02:37.896 INFO   tofu: OpenTofu has been successfully initialized!
01:02:38.794 STDOUT tofu: vault_generic_secret.longhorn_secrets: Refreshing state... [id=secret/TF-Longhorn-s3-keys]
01:02:38.797 STDOUT tofu: kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
01:02:39.261 STDOUT tofu: kubernetes_manifest.longhorn_external_secret: Refreshing state...
01:02:39.449 STDOUT tofu: helm_release.longhorn: Refreshing state... [id=longhorn]
01:02:40.746 STDOUT tofu: kubectl_manifest.longhorn_daily_backup: Refreshing state... [id=/apis/longhorn.io/v1beta1/namespaces/longhorn-system/recurringjobs/daily-backup]
01:02:43.026 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:02:43.026 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:02:43.026 STDOUT tofu:   ~ update in-place
01:02:43.026 STDOUT tofu: OpenTofu planned the following actions, but then encountered a problem:
01:02:43.026 STDOUT tofu:   # helm_release.longhorn will be updated in-place
01:02:43.026 STDOUT tofu:   ~ resource "helm_release" "longhorn" {
01:02:43.026 STDOUT tofu:       ~ id                         = "longhorn" -> (known after apply)
01:02:43.026 STDOUT tofu:       ~ metadata                   = {
01:02:43.026 STDOUT tofu:           ~ app_version    = "v1.8.1" -> (known after apply)
01:02:43.026 STDOUT tofu:           ~ chart          = "longhorn" -> (known after apply)
01:02:43.026 STDOUT tofu:           ~ first_deployed = 1747009042 -> (known after apply)
01:02:43.026 STDOUT tofu:           ~ last_deployed  = 1747009384 -> (known after apply)
01:02:43.027 STDOUT tofu:           ~ name           = "longhorn" -> (known after apply)
01:02:43.027 STDOUT tofu:           ~ namespace      = "longhorn-system" -> (known after apply)
01:02:43.027 STDOUT tofu:           ~ revision       = 2 -> (known after apply)
01:02:43.027 STDOUT tofu:           ~ values         = jsonencode(
01:02:43.027 STDOUT tofu:                 {
01:02:43.027 STDOUT tofu:                   - defaultBackupStore = {
01:02:43.027 STDOUT tofu:                       - backupTarget                 = "s3://longhorn@us-east-1/"
01:02:43.027 STDOUT tofu:                       - backupTargetCredentialSecret = "longhorn-secrets"
01:02:43.027 STDOUT tofu:                     }
01:02:43.027 STDOUT tofu:                   - defaultSettings    = {
01:02:43.027 STDOUT tofu:                       - systemManagedComponentsNodeSelector = "!node-role.kubernetes.io/master"
01:02:43.027 STDOUT tofu:                     }
01:02:43.027 STDOUT tofu:                   - longhornUI         = {
01:02:43.027 STDOUT tofu:                       - replicas = 1
01:02:43.027 STDOUT tofu:                     }
01:02:43.027 STDOUT tofu:                   - persistence        = {
01:02:43.027 STDOUT tofu:                       - defaultClassReplicaCount = 2
01:02:43.027 STDOUT tofu:                     }
01:02:43.027 STDOUT tofu:                 }
01:02:43.027 STDOUT tofu:             ) -> (known after apply)
01:02:43.027 STDOUT tofu:           ~ version        = "1.8.1" -> (known after apply)
01:02:43.027 STDOUT tofu:         } -> (known after apply)
01:02:43.028 STDOUT tofu:         name                       = "longhorn"
01:02:43.028 STDOUT tofu:       ~ version                    = "1.8.1" -> "1.9.0"
01:02:43.028 STDOUT tofu:         # (26 unchanged attributes hidden)
01:02:43.028 STDOUT tofu:     }
01:02:43.028 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:02:43.030 STDERR tofu: Error: failed to lookup token, err=Error making API request.
01:02:43.031 STDERR tofu: URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
01:02:43.031 STDERR tofu: Code: 503. Errors:
01:02:43.031 STDERR tofu: * Vault is sealed
01:02:43.031 STDERR tofu:   with vault_generic_secret.longhorn_secrets,
01:02:43.031 STDERR tofu:   on main.tf line 7, in resource "vault_generic_secret" "longhorn_secrets":
01:02:43.031 STDERR tofu:    7: resource "vault_generic_secret" "longhorn_secrets" {
01:02:43.035 ERROR  tofu invocation failed in ./.terragrunt-cache/vDeUHIUFt78pEwGiXPS1x3QJjok/CMgYoIKCnhbkpRAUkBJBc7x_LD8
01:02:43.035 ERROR  error occurred:

* Failed to execute "tofu plan -input=false -out ./terragrunt_kubernetes_longhorn.tfplan -no-color" in ./.terragrunt-cache/vDeUHIUFt78pEwGiXPS1x3QJjok/CMgYoIKCnhbkpRAUkBJBc7x_LD8
  
  Error: failed to lookup token, err=Error making API request.
  
  URL: GET http://vault.localdomain:8200/v1/auth/token/lookup-self
  Code: 503. Errors:
  
  * Vault is sealed
  
    with vault_generic_secret.longhorn_secrets,
    on main.tf line 7, in resource "vault_generic_secret" "longhorn_secrets":
     7: resource "vault_generic_secret" "longhorn_secrets" {
  
  
  exit status 1


Authenticated

```
</details>